ut-robotics/picr21-team-jordan/electronics_and_firmware/STM32_code/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2021 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32g4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

void HAL_TIM_MspPostInit(TIM_HandleTypeDef *htim);

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define PWM_M2_Pin GPIO_PIN_0
#define PWM_M2_GPIO_Port GPIOA
#define PWM_M1_Pin GPIO_PIN_1
#define PWM_M1_GPIO_Port GPIOA
#define PWM_M3_Pin GPIO_PIN_2
#define PWM_M3_GPIO_Port GPIOA
#define PWM_Thrower_Pin GPIO_PIN_3
#define PWM_Thrower_GPIO_Port GPIOA
#define DIR_M2_Pin GPIO_PIN_5
#define DIR_M2_GPIO_Port GPIOA
#define DIR_M1_Pin GPIO_PIN_6
#define DIR_M1_GPIO_Port GPIOA
#define DIR_M3_Pin GPIO_PIN_7
#define DIR_M3_GPIO_Port GPIOA
#define Encoder_3_1_Pin GPIO_PIN_8
#define Encoder_3_1_GPIO_Port GPIOA
#define Encoder_3_0_Pin GPIO_PIN_9
#define Encoder_3_0_GPIO_Port GPIOA
#define Debug_LED_Pin GPIO_PIN_10
#define Debug_LED_GPIO_Port GPIOA
#define Encoder_2_0_Pin GPIO_PIN_15
#define Encoder_2_0_GPIO_Port GPIOA
#define Encoder_1_0_Pin GPIO_PIN_6
#define Encoder_1_0_GPIO_Port GPIOB
#define Encoder_1_1_Pin GPIO_PIN_7
#define Encoder_1_1_GPIO_Port GPIOB
#define Encoder_2_1_Pin GPIO_PIN_8
#define Encoder_2_1_GPIO_Port GPIOB
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
